#include <iostream> 
using namespace std; // Використання простору імен std

int main() {
    setlocale(LC_ALL, "rus");
    cout << "Розмір = 5 : "; // Вивід повідомлення
    const int n = 5; // Оголошення змінної для розміру масиву
    int arr[n]; // Оголошення масиву
    for (int i = 0; i < n; i++) { // Цикл для введення елементів масиву
        cout << "Введіть елемент " << i + 1 << ": "; // Вивід повідомлення
        cin >> arr[i]; // Введення елемента масиву
    }

    int* ptr = arr; // Вказівник на перший елемент масиву
    int sum = 0; // Змінна для суми елементів масиву

    for (int i = 0; i < n; i++) { // Цикл для перебору елементів масиву
        sum += *(ptr + i); // Додавання поточного елемента до суми
    }

    double avg = static_cast<double>(sum) / n; // Обчислення середнього значення
    cout << "Середнє значення елементів масиву = " << avg << endl; // Вивід середнього значення

    return 0; // Завершення програми
}
