#include <iostream> // Підключення бібліотеки 
using namespace std; // Використання простору імен std

int main() {
    setlocale(LC_ALL, "rus");
    cout << "Розмір = 10 : "; // Вивід повідомлення
    const int n = 10; // Оголошення змінної для розміру масиву
    int arr[n]; // Оголошення масиву
    for (int i = 0; i < n; i++) { // Цикл для введення елементів масиву
        cout << "Введіть елемент " << i + 1 << ": "; // Вивід повідомлення
        cin >> arr[i]; // Введення елемента масиву
    }

    int* ptr = arr; // Вказівник на перший елемент масиву
    int min_val = *ptr, max_val = *ptr; // Змінні для мінімального та максимального значень
    int min_index = 0, max_index = 0; // Змінні для індексів мінімального та максимального значень

    for (int i = 0; i < n; i++) { // Цикл для перебору елементів масиву
        if (*(ptr + i) < min_val) { // Якщо поточний елемент менше мінімального значення
            min_val = *(ptr + i); // Оновлення мінімального значення
            min_index = i; // Оновлення індексу мінімального значення
        }
        if (*(ptr + i) > max_val) { // Якщо поточний елемент більше максимального значення
            max_val = *(ptr + i); // Оновлення максимального значення
            max_index = i; // Оновлення індексу максимального значення
        }
    }

    cout << "Мінімальне значення: " << min_val << ", позиція: " << min_index + 1 << endl; // Вивід мінімального значення та його позиції
    cout << "Максимальне значення: " << max_val << ", позиція: " << max_index + 1 << endl; // Вивід максимального значення та його позиції
    cout << "Відстань між мінімальним та максимальним елементами: " << abs(max_index - min_index) << endl; // Вивід відстані між мінімальним та максимальним елементами

    return 0; // Завершення програми
}